{"original_title":{"2014":"All Dogs Go to Heaven","3427":"Guys and Dolls","3632":"The Adventures of Rocky & Bullwinkle","4122":"Kingdom Come","4208":"Nattevagten","5433":"Johnny Dangerously","6123":"Wind","7126":"The Wilby Conspiracy","7343":"Summertime","7496":"Satsujin ken 2","8144":"The Last Shot","8516":"The Spirit of St. Louis","13062":"Filth and Wisdom","14289":"¡Que Viva México! - Да здравствует Мексика!","14483":"Out of Reach","14675":"Το τελευταίο ψέμα","15083":"The Ascent of Money","15470":"Hell and High Water","15632":"L'important c'est d'aimer","16255":"Caribe","16444":"Disraeli","17063":"The House of Rothschild","17315":"Corri uomo corri","17664":"The Greatest Movie Ever Sold","17740":"I Don't Know How She Does It","17827":"नीचा नगर","18991":"Une vie meilleure","19316":"최종병기 활","21536":"The First Nudie Musical","22864":"عمر","23775":"Blood in the Mobile","24533":"The Crew","24874":"Jules Verne's Rocket to the Moon","25059":"冰封俠: 重生之門","26133":"L'amour, l'argent, l'amour","28832":"Master of the Universe","29021":"Piggy Banks","29296":"The Forger","29304":"Armi elää!","29505":"The Four Year Plan","29569":"Vanishing Pearls: The Oystermen of Pointe à la Hache","29662":"Un posto ideale per uccidere","30082":"The Yellow Balloon","30309":"The Prospects","30419":"The Men Who Built America","31886":"Carry On Columbus","33125":"Island of Love","33428":"Roukli","34216":"വർഷം","34407":"Hum Saath Saath Hain","35230":"Love at the Thanksgiving Day Parade","35324":"Lottovoittaja UKK Turhapuro","36463":"Balls to the Wall","37181":"The Lost Man","38379":"Black Tuesday","39000":"Il ginecologo della mutua","39667":"Den demokratiske terroristen","40397":"Waffle Street","40736":"Oliver's Deal","40878":"Isteni műszak","42923":"Milton's Secret","43122":"Princesa","43318":"The Book of Henry","43375":"Day of the Fight","44482":"Der Schuh des Manitu","45372":"Treasure Raiders"},"overview":{"2014":"When a casino owning dog named Charlie is murdered by his rival Carface, he finds himself in Heaven basically by default since all dogs go to heaven. However, since he wants to get back at his killer, he cons his way back to the living with the warning that doing that damns him to Hell. Once back, he teams with his old partner, Itchy to prep his retaliation. He also stumbles on to an orphan girl who can talk to the animals, thus allowing him to get the inside info on the races to ensure his wins to finance his plans. However, all the while, he is still haunted by nightmares on what's waiting for him on the other side unless he can prove that he is worthy of Heaven again.","3427":"In New York, a gambler is challenged to take a cold female missionary to Havana, but they fall for each other, and the bet has a hidden motive to finance a crap game.","3632":"Rocky and Bullwinkle have been living off the finances made from the reruns of their cartoon show. Boris and Natasha somehow manage to crossover into reality and team up with Fearless Leader, an evil criminal turned media mogul with some evil plans up his sleeve. Rocky and Bullwinkle must stop the three of them before they wreak havoc.","4122":"The documentary, Kingdom Come follows a first-time director (Daniel Gillies) as he tries to raise a million dollars to finance his first film, Broken Kingdom. This emotionally-charged journey is interwoven with over 30 rare interviews from acclaimed indie darlings including Mark Ruffalo, Illeana Douglas, Don Cheadle, Kevin Smith, Edward Burns, Tim Roth, Morgan Spurlock, Selma Blair, Robert Townsend, Bill Pullman and many more.","4208":"In order to finance his law studies, Martin starts as a night watchman in a mortuary. When the victims of a serial killer of prostitutes are deposited there, scary things begin to happen. Therefore and because of a strange bet with his fellow student Jens, the police begins to think he is the murderer. Police detective Wormer wants to help him but Martin is more and more suspected.","5433":"Set in the 1930s, an honest, goodhearted man is forced to turn to a life of crime to finance his neurotic mother's skyrocketing medical bills.","6123":"In 1983, yacht sailor Will Parker leads an American crew financed by millionaire Morgan Weld to defeat during the America's Cup race against an Australian crew. Determined to get the prize back, Will convinces Morgan to finance an experimental boat designed by his ex-girlfriend Kate's new beau, Joe Heisler. When the boat is completed, the Americans head to Australia to reclaim the cup.","7126":"Having spent 10 years in prison for nationalist activities, Shack Twala is finally ordered released by the South African Supreme Court but he finds himself almost immediately on the run after a run-in with the police. Assisted by his lawyer Rina Van Niekirk and visiting British engineer Jim Keogh, he heads for Capetown where he hopes to recover a stash of diamonds, meant to finance revolutionary activities, that he had entrusted to a dentist before his incarceration. Along the way, they are followed by Major Horn of the South African State security bureau and it becomes apparent that he has no intention of arresting them until they reach their final destination","7343":"Middle-aged Ohio secretary Jane Hudson has never found love and has nearly resigned herself to spending the rest of her life alone. But before she does, she uses her savings to finance a summer in romantic Venice, where she finally meets the man of her dreams, the elegant Renato Di Rossi. But when she learns that her new paramour is leading a double life, she must decide whether her happiness can come at the expense of others.","7496":"Second in a series starting with The Street Fighter starring Sonny Chiba. In this sequel, Martial artist Takuma Tsurugi returns to take on a Yakuza family that may be embezzling money from charities to finance their own operations. Both the police and the Yakuza find themselves battling Tsurugi, but Tsurugi's fight ultimately is with the mob, and he concentrates on them.","8144":"A movie director-screenwriter finds a man to finance his latest project but soon discovers that the producer is actually an undercover FBI agent working on a mob sting operation.","8516":"Charles 'Slim' Lindbergh struggles to finance and design an airplane that will make his New York to Paris flight the first solo transatlantic crossing.","13062":"Filth &amp; Wisdom is a poignant view of the lives of three not quite ordinary friends settled into meaningless jobs that barely keep them afloat while helping to finance their dreams of bigger and brighter futures. Their unqiue yet universal stories capture their struggles that are at turns funny and tragic but always brutally honest. Their intertwined lives explore the inevitable: a path paved with filth will often end in wisdom and one paved with wisdom will often end in filth.","14289":"¡Qué viva México! was a film project undertaken in 1931-32 by Soviet film-maker Sergei Eisenstein for American socialist author Upton Sinclair and several investors, which Eisenstein eventually conceived as an episodic portrayal of Mexican culture and politics from pre-Conquest civilization to the Mexican revolution. Over 200,000 feet of silent film were shot before production had to be stopped due to exhaustion of finances and Stalin's demands that Eisenstein return to the USSR.  This is one of several attempts to make a feature film out of the existing footage, here according to Eisenstein's skeletal outline and under the supervision of Gregori Alexandrov, Eisenstein's long-time collaborator, including on this project.","14483":"Vietnam veteran Billy Ray Lancing, a former CSA agent who now works on a wildlife refuge in Northern Alaska, has been exchanging letters in a pen-pal relationship with Irina Morawska, a 13-year-old orphaned girl in Poland that he's helping out financially. When the letters suddenly stop coming, Billy heads to Poland to figure out why -- only to discover that the orphanage that Irina was staying in, which is financed by honest -- and unsuspecting -- good-intentioned Samaritans, is a cover for a human trafficking network.","14675":"During one of her parents many parties, Chloe learns they're bankrupt. She's being courted by Niko, a wealthy Greek American, so she decides to charm him. He's quickly captivated. That night, she also meets the masculine Galanos and sparks fly. Niko proposes, Chloe accepts, Galanos tries to change her mind. Her father wants to disclose their finances to Niko, her mother argues against it as a matter of dignity. The family's long-time servant must care for her son, who's had an accident. She's has not been paid in months, reminds Chloe to send money, and waits in her village as hospital bills mount. The servant comes back to Athens, confronts Chloe's mother, and a crisis ensues.","15083":"British historian and author Niall Ferguson explains how big money works today as well as the causes of and solutions to economic catastrophes in this extended version The Ascent of Money documentary. Through interviews with top experts, such as former Federal Reserve Chairman Paul Volcker and American currency speculator George Soros, the intricate world of finance, including global commerce, banking and lending, is examined thoroughly.","15470":"A privately-financed scientist and his colleagues hire an ex-Navy officer to conduct an Alaskan submarine expedition in order to prevent a Red Chinese anti-American plot that may lead to World War III. Mixes deviously plotted schoolboy fiction with submarine spectacle and cold war heroics.","15632":"Servais Mont, a photographer, meets Nadine Chevalier who earns her money starring in cheap soft-core movies. Trying to help her, he borrows the money from the loan sharks to finance the theatrical production of 'Richard III' and gives Nadine a part.","16255":"Vicente and Abigail run a banana plantation in Limon Province, on the Caribbean coast of Costa Rica. Abigail's half-sister Irene, about whom Abigail knew nothing, comes to introduce herself. Banana prices start falling, threatening the plantation's finances. An oil company works with the government to get off-shore drilling rights, over local objection. Vicente is at the center of each cross-current. Will he fall for Irene? Can he save the plantation? Will he sell out to corporate offers?","16444":"Biopic of the famed British Prime Minister focusing on his concern about Russia's growing interest in the Indian subcontinent and his attempts to buy the Suez Canal. He sees the Canal as the key strategic resource in maintaining the Empire in the East but is unpopular in many quarters. With antisemitism rife at the time, Disraeli finds little support for his plan to purchase the canal or his foreign policy in general. There is no doubt that the Russians are plotting against British interests and he is surrounded by spies, even in his office at 10 Downing St. When the Bank of England refuses to finance the purchase of the available shares he turns to private sources to raise the available cash only to find the conspirators one step ahead of him.","17063":"The story of the rise of the Rothschild financial empire founded by Mayer Rothschild and continued by his five sons. From humble beginnings the business grows and helps to finance the war against Napoleon, but it's not always easy, especially because of the prejudices against Jews.","17315":"The legendary Tomas Milian stars as Cuchillo, a knife-throwing thief on the run from murderous bandits, sadistic American agents, his hot-blooded fiancée and a sheriff turned bounty hunter, all of whom are gunning for a hidden fortune in gold that could finance the Mexican Revolution.","17664":"A documentary about branding, advertising and product placement that is financed and made possible by brands, advertising and product placement.","17740":"A comedy centered on the life of Kate Reddy, a finance executive who is the breadwinner for her husband and two kids.","17827":"Neecha Nagar, released in 1946 is a Hindi film directed by Chetan Anand. This film is considered as one of the pioneering efforts in the field of expressionist social realism in Indian Cinema. Written by Khwaja Ahmad Abbas, this film is inspired by Maxim Gorky’s Lower Depths. The film was financed by the Indian People’s Theater Association (IPTA).","18991":"Yann, a cook, and Nadia, a waitress and mother of 9-year-old child, decide to risk everything on the purchase of a restaurant.  With plenty of talent, energy, love and dreams, but no finance of their own, they find themselves forced into a jungle of financing and bank loans that quickly overwhelms them. To bail them out, Nadia has to take a job in Canada, while Yann is forced to stay behind to save the restaurant.  Together, he and the child confront a relentless avalanche of creditors, an uncaring system and the daily grind from which there is no respite…  Yann finally understands that his only chance of salvation lies in joining his lover – as well as reuniting mother and child – by following Nadia to Canada and a better life.","19316":"13 years after the King Injo Revolt, the Chosun Dynasty is attacked by the Chung Dynasty of China. A young man named Na-mi leaves his demolished village to find his young sister, Ja-in, and her finance Su-koon, who were to wed on the very day of the attack. While on his mission to rescue her, he is being traced by Jushinta, a fierce Chung Warrior, and his band of malicious men who are out to stop him. Na-mi has but a day to rescue his sister before she is taken away to be a slave. When Na-mi finally finds his sister, Jushinta comes between them and a fierce battle between two of the finest warriors unfolds.","21536":"The son of famous studio owner is forced to make porno films to keep the bankrupt studio from being made into a shopping center. In an attempt to get back on the high ground he makes a nudie musical. He makes a bet with the debtors who wish to take ownership of the studio, that if they finance the musical and he can't complete it within two weeks, they can foreclose.","22864":"The drama, the story of three childhood friends and a young woman who are torn apart in their fight for freedom, is billed as the first fully-financed film to come out of the Palestinian cinema industry.","23775":"The production of phones has a dark, bloody side. The main part of minerals used to produce phones is coming from the mines in the Eastern DR Congo. The Western World is buying these so-called conflict minerals and thereby finances a civil war that, according to human rights organisations, has been the bloodiest conflict since World War II: During the last 15 years the conflict has cost the lives of more than 5 million people and 300,000 women have been raped. The war will continue as long as armed groups can finance their warfare by selling minerals. The Documentary Blood in the Mobile shows the connection between our phones and the civil war in the Congo. Director Frank Poulsen travels to DR Congo to see the illegal mine industry with his own eyes. He gets access to Congo s largest tin-mine, which is being controlled by different armed groups, and where children work for days in narrow mine tunnels to dig out the minerals that end up in our phones.","24533":"Hoping to raise enough capital to finance a legitimate business and leave behind his life of crime, Liverpool underworld boss Ged Brennan (Scot Williams) sends his brother Ratter (Kenny Doughty) and a crew to pull a daring final heist. But when Ratter kills a drug kingpin during the job, Brennan must turn to rival crook Franner (Stephen Graham) to avert an all-out gangland war. This thriller from director Adrian Vitoria co-stars Cordelia Bugeja.","24874":"Phineas T. Barnum and friends finance the first flight to the moon but find the task a little above them. They attempt to blast their rocket into orbit from a massive gun barrel built into the side of a Welsh mountain, but money troubles, spies and saboteurs ensure that the plan is doomed before it starts...","25059":"In the Ming Dynasty, there lives four orphans, Ying, Sao, Yuanlong and Niehu. Raised in Taoyuan Village, the four are as closed as brothers. Their exceptional martial arts skills allows them to reach the highest rank within the imperial guards. After the four successfully killed the Japanese troop leader, the Emperor orders Ying to escort the Golden Wheel of Time from Sindu (now India) back to the capital, which is said to have the power of time travel and foresee into the future.  Now in 2013, Squire Tang, funded by a mysterious financer, digs up three ancient icemen from the outskirt of China; they are Ying, Sao and Niehu. As he is transferring the icemen to Hong Kong for further studies, the vehicle involves in a traffic accident which, unexpectedly, defrosts Ying...","26133":"David, a recently fired scrapyard worker and Marie, a prostitute, both about 20 years old, meet on New Year's Eve in Berlin and decide to run away together. As David's arm is plastered from an accident Marie continues to prostitute herself to finance their restless journey through the Ruhr area. Their love and their will to survive guide them though all problems.","28832":"He was one of Germany's leading investment experts with an income of several million Euros per day. Now, he sits on one of the upper floors of an empty bank building in the middle of Frankfurt, overlooking a skyline of glass and steel. And talks. In an extended mix of a monologue and an in-depth interview, which is as frightening as it is fascinating, he shares his inside knowledge from a megalomaniac parallel world where illusions are the market's hardest currency. Marc Bauder's 'Master of the Universe' is based on meticulous research and provides us with geniune insight into the notoriously secretive and self-protective 'universe' of which our nameless protagonist experiences himself a master. Where other films on the financial meltdown have focused on the epic nature of larger-than-life business, Bauder probes the mentality that made it possible in the first place. A tense drama where psychology meets finance - two things that are more closely linked than you would like to believe.","29021":"iggy Banks tells the story of two charming and brilliant brothers who finance their lifestyle by robbing and murdering pretty much anyone foolish enough to get in the car with them. They learn the business from their sociopath father (Tom Sizemore) who doesn't bother to hide his crimes, or the brutal philosophy which drives it. He tells his sons people are just piggy banks. You need money? Just break one open. Michael is sloppy and reckless he goes about his work with a demented glee, John perhaps even more horrifyingly, understands the misery he inflicts he simply doesn't care. It's just a job. Lock all your doors.","29296":"A former child art prodigy and second generation petty thief arranges to buy his way out of prison to spend time with his ailing son, only to be forced to alter his plans and commit one more job for the man who financed his release.","29304":"Armi Ratia is the woman behind the legendary design company Marimekko and a worldwide celebrity. A theatre company has taken on the task of trying to portray the life and work of this complex person. The sets mainly consist of the well-known patterns that we all have grown to love. Armi is a brave, risk-taking businesswoman and her passion for her company repeatedly takes its toll on her employees, finances and family. The company grows while Armi's personal life is shaken by suicide attempts and turbulence. In Armi Alive!, Oscar-nominated film producer and director Jörn Donner portrays a fascinating woman with fervent ideas about the new Finnish man, her company, fabrics and clothes.","29505":"In 2007 Queens Park Rangers, a small Football Club of West London, were bottom of England's Second League and 2 hours from bankruptcy. Just as the club faced liquidation, they were bought by billionaire businessmen. Filmed in an observational fashion from a poetic distance, the documentary follows the larger than life and high profile characters who put their money and reputations on the line through 4 tumultuous years of enormous ups and downs. For 98 dramatic minutes we are given unprecedented access and remarkable insight into the worlds of sport, business, finance, power and ego - culminating in success in 2011, when QPR won promotion to the Premier League and the four year plan - set out by the owners in 2007 - was spectacularly achieved.","29569":"The Oystermen of Pointe a la Hache, Louisiana. This town of nearly 300 is struggling to survive following the BP Oil Spill that left their crop dead, finances in ruin and culture facing extinction. This community has a history of being overlooked by the State, and therefore, are taking matters into their own hands, to assure their voice is heard so that they may not otherwise vanish","29662":"Two young sexually free hippies, Dick (Ray Lovelock) and Ingrid (Ornella Muti) finance their travels by selling naked snaps of Ingrid until their plan is brought to an abrupt end by the Police. Forced on the run the two seek refuge at a seemingly empty isolated large villa. As it turns out the house is inhabited by the middle-aged Barbara (Irene Papas) who invites them in for some potential three-way hanky-panky that soon locks them into something far more twisted and chilling!","30082":"One of two young boys accidentally falls to his death when playing in a bombed-out London neighborhood. Frankie, the survivor feels guilty about his friend's death. Len, a petty thief who has just killed a pub owner during a botched robbery, learns of the accident. He poses as Frankie's friend and blackmails the boy into stealing from his parents to finance Len's escape. When Len decides that Frankie may know enough to connect him with the murder, he decides to silence the boy in a tense \"hide and seek\" chase through the ruins.","30309":"In Brooklyn live two young street musicians who since childhood dream of building a recording studio together. Charlie, who plays the banjo, just inherited a house with a large basement. His best friend and manager Ted thinks it might be the perfect place for the studio but they need $ 25,000 to fulfill their dream. One day a Jamaican nurse approaches them on the street asking for help to lift a patient who has fallen down. Ted finds a collection of rare baseball cards in the house of the patient, and soon will plot a plan to steal the valuable collection to finance their studio. But when Charlie gets involved in a relationship with the nurse, Ted plans will be disrupted and his friendship with Charlie threatened.","30419":"John D. Rockefeller, Cornelius Vanderbilt, Andrew Carnegie, Henry Ford and J.P. Morgan rose from obscurity and in the process built modern America. Their names hang on street signs, are etched into buildings and are a part of the fabric of history. These men created the American Dream and were the engine of capitalism as they transformed everything they touched in building the oil, rail, steel, shipping, automobile and finance industries. Their paths crossed repeatedly as they elected presidents, set economic policies and influenced major events of the 50 most formative years this country has ever known. From the Civil War to the Great Depression and World War I, they led the way.","31886":"Christopher Columbus believes he can find an alternative route to the far East and persuades the King and Queen of Spain to finance his expedition...","33125":"Con artist Steve Blair persuades Tony Dallas, a Manhattan gangster, to finance a movie about Adam and Eve by offering the female lead to Tony's stripper girl friend, Cha Cha Miller. The film is such a disaster, however, that Steve and his writer, Paul Ferris, decide to escape on a freighter to Greece. En route, Steve learns that the island of Paradeisos has lost its tourist trade because it has no apparent historical or mythological heritage. Intrigued, he hits upon the scheme of turning Paradeisos into a legendary island of love and taking a cut from all commercial enterprises. After planting Greek antiquities in the waters surrounding the island, Steve induces Paul to \"recover\" them, thus causing the tourist trade to increase.","33428":"Roukli is a film about about love, war and something else.  Estonian director Veiko Õunpuu (Autumn Ball, The Temptation of St. Tony, Free Range\/Ballad on Approving of the World) made his new film Roukli without institutional financial support. The film was made through an experimental process of improvisation and financed through the Estonian crowdfunding platform Hooandja. According to Õunpuu, the reasons for turning to crowdfunding and improvisation for his new film were creative. “We find creative freedom in independence from institutional support,” Õunpuu said.","34216":"The film narrates the tale of Venu, owner of a small finance company in Thrissur. His life is shaken up after some unprecedented events leaving him at a dead end. This movie is about how he finds a purpose to live.","34407":"The trials and challenges of a joint family in India, whose parents are Ramkishen and second wife Mamta, and have three sons and a married daughter. The eldest son is handicapped since birth, and is from Ramkishen's first wife. Mamta, the second wife, hates him, and like Kaikeyi in Ramayana wants the estate and wealth in her sons' names. She and her daughter's father-in-law, scheme together, and have the eldest son, including his wife and child, thrown out of the house. Mamta and her sons are all set to control the finances and the estate - until she finds out that her very own sons do not approve of nor support her actions in throwing their step-brother out of the house.","35230":"As Chicago gears up for its annual Thanksgiving Day parade, Emily Jones, an eager parade coordinator is shocked when Henry Williams, a wealthy new development consultant, is brought in to analyze the parade's finances.","35324":"It is the first anniversary of Uuno and Elisabet. Uuno has placed a bet with his friend Härski-Hartikainen a year ago, that if Uuno can take just one year of marriage with Elisabet, Hartikainen will treat him a festive dinner. However, Hartikainen buys a lottery ticket for Uuno, who agrees to deduct it from his debt – and the festive dinner is reduced to a can of milk and half a sausage. As it happens, Uuno becomes the lottery winner of 1.5 million marks, only to soon realize he doesn't own a single penny yet. Mister Tossavainen arrives and offers to finance Uuno before he actually gets the jackpot. Thus, Uuno gets to live a rich live on credit. He buys a raccoon fur, leopard swimming trunks and a couple of Mercedes-Benzes. Women begin to fancy Uuno and so does his father-in-law. As time goes by it is revealed, though, that Uuno is not actually a lottery winner, and so he has to escape the anger of others to Härski's car repair shop.","36463":"Ben's fiancée has her heart set on an expensive dream wedding, but her father, Jack, has secretly gambled away all his money. When Ben discovers he has a talent for exotic dancing, Jack pushes him to moonlight as a stripper to finance the wedding.","37181":"A gang of black militants plots to rob a factory to finance their \"revolutionary struggle.\"","38379":"Vicious gangster Vincent Canelli pulls off a daring prison escape just moments before going to the electric chair, taking with him Peter Manning – a bank robber and cop killer who was to die right after him. Taking several hostages along, they try to get their hands on the loot from Manning’s robbery to finance their escape from the country.","39000":"Dr. Lo Bianco, debt load, flees abroad and the headquarters avviatissimo study gynecological colleague Giovannaldi. These are adept at gaining the trust of high society and, thanks to the relationship established with the wife of a wealthy manufacturer (enough to get her pregnant), she becomes finance, own the cuckolded husband, a luxury clinic. And there will be a prize for Lobianco.","39667":"Hamilton is assigned to infiltrate a terrorist group in West Germany, a part of the Red Army Faction (RAF), that supposedly are planning an operation in Sweden. Hamilton is chosen because of his background in the leftist movement. As a member of the group, he takes part in bank robberies — the preferred way of the RAF to finance their operations. In the end, when all terrorists are in one place, he leads the German Counter-terrorism unit GSG 9 to the location.  Description above from the Wikipedia article Carl Hamilton novels, licensed under CC-BY-SA, full list of contributors on Wikipedia.","40397":"WAFFLE STREET is the true story of Jimmy Adams, a V.P. of a $30 billion hedge fund, who loses his job and winds up working as a waiter at a waffle shop. Amidst the greasy madness of the 24-hour diner, Jimmy befriends Edward, an ex-con grill master who serves up hard lessons about life, finance, and grits.","40736":"Set against the backdrop of an international finance deal in New York and Peru, Oliver's Deal is an intense political drama which explores how far people will go to get what they want.","40878":"Death does not select, man does. Set in Budapest, Heavenly Shift offers an eerie insight into the everyday lives of a rather extraordinary ambulance crew. The films main character is Milan, a young refugee from the Balkan War, who joins a team of paramedics but inadvertently ends up involved in the funeral business in order to finance his fiancee s rescue from the hostilities.","42923":"11 year-old Milton Adams is growing up in an uncertain world. With his parents constantly stressing about their careers and finances, and the neighborhood bully tormenting him, Milton feels his whole world is in crisis. But when his Grandpa Howard comes to visit, he discovers anxiety about the past and worrying about the future only make things worse and prevent him from finding true happiness moment to moment.","43122":"Fernando\/Fernanda, a 19-year-old Brazilian transvestite, travels to Milan and becomes a prostitute to finance a sex-change operation.","43318":"Naomi Watts stars as Susan, a single mother of two, working as a waitress in a small town. Her son, Henry, is an 11-year-old genius who not only manages the family finances but acts as emotional support for his mother and younger brother. When Henry discovers that the girl next door has a terrible secret, he implores Susan to take matters into her own hands in this imaginative and emotional drama.","43375":"American short subject documentary film in black-and-white, which is notable as the first picture directed by Stanley Kubrick. Kubrick financed the film himself, and it is based on an earlier photo feature he had done as a photographer for Look magazine in 1949. 'Day of the Fight' shows Irish-American middleweight boxer Walter Cartier during the height of his career, on the day of a fight with black middleweight Bobby James, which took place on April 17, 1950.","44482":"Abahachi, Chief of the Apache Indians, and his blood brother Ranger maintain peace and justice in the Wild West. One day, Abahachi needs to take up a credit from the Shoshone Indians to finance his tribe's new saloon. Unfortunately Santa Maria, who sold the saloon, betrays Abahachi, takes the money and leaves. Soon, the Shoshones are on the warpath to get their money back, and Abahachi is forced to organize it quickly.","45372":"Michael, an American professor teaching history at Moscow University, finances his passion for treasure hunting with competitive street racing. His racing nemesis Wolf becomes his ally as they both embark on a quest to search for a famous ancient Russian treasure."}}